cf/Catalogs/FullPathsToForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>FullPathsToForms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FullPathToForm</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/InformationReferencesForForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>InformationReferencesForForms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConfigurationVersionBefore</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConfigurationVersionFrom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActualityBeginningDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActualityEndingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullPathToForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FullPathsToForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/InformationCenterServerReUse/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Subsystem "Information center".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// SERVICE PROGRAMMING INTERFACE

// Returns a table with info references for forms
//
// Parameters:
// HashPathToForm - String - hash of a full path to the form.
//
// Returns:
// ValueTable - table of info references for a form with columns:
// 	Description - String - name of info ref
// 	Address - String - external address of info ref
// 	Weight - Number - info ref weight 
// 	ActualityBeginningDate - Date - Start date of the information reference relevance
// 	ActualityEndingDate - Date - End date of the information reference relevance
// 	ToolTip - String - information reference tooltip
//
Function GetTableInformationLinksForForms(HashPathToForm) Export
	
	Query = New Query;
	Query.SetParameter("Hash", HashPathToForm);
	Query.SetParameter("CurrentDate", CurrentDate());
	Query.Text = 
	"SELECT
	|	FullPathsToForms.Ref AS Ref
	|INTO PathToForms
	|FROM
	|	Catalog.FullPathsToForms AS FullPathsToForms
	|WHERE
	|	FullPathsToForms.Hash = &Hash
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	InformationReferencesForForms.Description AS Description,
	|	InformationReferencesForForms.Address AS Address,
	|	InformationReferencesForForms.Weight AS Weight,
	|	InformationReferencesForForms.ActualityBeginningDate AS ActualityBeginningDate,
	|	InformationReferencesForForms.ActualityEndingDate AS ActualityEndingDate,
	|	InformationReferencesForForms.ToolTip AS ToolTip
	|FROM
	|	PathToForms AS PathToForms
	|		INNER JOIN Catalog.InformationReferencesForForms AS InformationReferencesForForms
	|		ON PathToForms.Ref = InformationReferencesForForms.FullPathToForm
	|WHERE
	|	InformationReferencesForForms.ActualityBeginningDate <= &CurrentDate
	|	AND InformationReferencesForForms.ActualityEndingDate >= &CurrentDate
	|
	|ORDER BY
	|	Weight DESC";
	
	Return Query.Execute().Unload();
	
EndFunction
